w-dee/esp-np2kai/hardware/bringup/esp32-p4/p4-nano/wireless/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# The physical P4-NANO is ESP32-P4 v1.3. Keep the diagnostic image in the
# v1.x revision envelope rather than inheriting IDF's v3.x default.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

CONFIG_ESP_HOSTED=y
CONFIG_ESP_HOSTED_HOST=y
CONFIG_ESP_HOSTED_HOST_TYPE_MCU=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_HOST_PORT_TYPE_ESP_IDF=y
CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_SDIO=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_HOST_SDIO_CLK_KHZ=20000
CONFIG_ESP_HOSTED_HOST_SDIO_BUS_WIDTH_4=y
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=54
CONFIG_ESP_HOSTED_HOST_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_HOST_TRANSPORT_RESTART_ON_FAILURE=n
CONFIG_ESP_HOSTED_HOST_TO_ESP_WIFI_DATA_THROTTLE=n
# ESP-Hosted 3.0.6 requires its auto-init header at compile time. Individual
# feature auto-init options remain disabled below; the library's system-level
# registration machinery is required for this build.
CONFIG_ESP_HOSTED_HOST_AUTO_FEAT_INIT=y

CONFIG_ESP_HOSTED_HOST_FEAT_RPC=y
CONFIG_ESP_HOSTED_HOST_FEAT_RPC_EXT_V2=y
CONFIG_ESP_HOSTED_HOST_FEAT_SYSTEM=y
CONFIG_ESP_HOSTED_HOST_FEAT_WIFI=n
CONFIG_ESP_HOSTED_HOST_FEAT_BT=n
CONFIG_ESP_HOSTED_HOST_FEAT_OTA=n
CONFIG_ESP_HOSTED_HOST_FEAT_OTA_AUTO_INIT=n
CONFIG_ESP_HOSTED_HOST_FEAT_HEARTBEAT=n
CONFIG_ESP_HOSTED_HOST_FEAT_POWER_SAVE=n
CONFIG_ESP_HOSTED_AUTO_CALL_INIT_BEFORE_APP_MAIN=n
